//TA_Lab_5_1_2023.c Робота з динамічною пам’яттю.
//Сума першої і другої половини динамічного масиву та кількість додатних елементів у кожній.

#define _CRT_SECURE_NO_WARNINGS

#include <locale.h>
#include <stdio.h>
#include <stdlib.h>
#include <conio.h>

void Sum_Number (int *A, int N, int M);

int main(void)
{	//Мова консолі українська
	system("chcp 1251");
	setlocale(LC_CTYPE, "ukr");
	system("cls");

	static int i, j;
	int n, m;
	do
	{
		printf("\n Задате кількість рядків (число більше 1) n= ");
		scanf("%d", &n);
		printf(" Задате кількість стовпців (число більше 1) m= ");
		scanf("%d", &m);
		if (n <= 1 && m <= 1) printf("\n Введені некоректні числа, кількість елементів в масиві менше 2. Спробуйте ще раз!");
	} while (n <= 1 && m <= 1);
	// Виділення пам'яті 
	int *a = (int*)malloc((n*m) * sizeof(int));
	if (a == NULL)
	{
		printf("Збiй при виділення динамічної памяті для масиву!");
		return 1;
	}

	// Ініціація масиву
	for (i = 0; i < n; i++) // цикл по рядках
	{
		for (j = 0; j < m; j++) // цикл по стовпцях
		{
			printf("a[%d][%d] = ", 1 + i, 1 + j);
			scanf("%d", (a + i * m + j));
		}
	}

	system("cls");
	
	printf(" Програма визначить суму першої і другої половини заданого масиву\n та кількість додатних елементів у кожній:\n");
	// Виведення елементів масиву
	printf("\n Заданий Вами масив розмірністю А[%d, %d] містить наступні елементи:\n", n, m);
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < m; j++)
		{
			printf("%5d ", *(a + i * m + j));
		}
		printf("\n");
	}
	
	Sum_Number(a, n, m);

	free(a);

	int getch(); getch();
	return (0);
}

void Sum_Number(int *A, int N, int M)
{
	int i, Sum1 = 0, Num1 = 0, Sum2 = 0, Num2 = 0;
	if ((N*M) % 2 != 0)
	{
		int Head = N*M/2;
		for (i=0; i < Head; i++)
		{
			Sum1 += *(A + i);
			if((*(A + i)) > 0) Num1++;
		}
		for (i; i < N*M; i++)
		{
			Sum2 += *(A + i);
			if ((*(A + i)) > 0) Num2++;
		}
		printf(" Ви задали масив з непарною к-стю елементів.\n");
		printf(" Програма розрахує: \n\t - суму першої частини масиву з кількістю елементів - %d, яка рівна: %d", Head, Sum1);
		printf(" \n\t - кількість додатних елементів в цій частині рівна: %d", Num1); 
		printf(" \n\t - суму другої частини масиву з кількістю елементів - %d, яка рівна: %d", N*M- Head, Sum2);
		printf(" \n\t - кількість додатних елементів в цій частині рівна: %d", Num2);
	}
	else 
	{
		
		int Half = N*M/2;
		for (i=0; i < Half; i++)
		{
			Sum1 += *(A + i);
			if ((*(A + i)) > 0) Num1++;
		}
		for (i; i < N*M; i++)
		{
			Sum2 += *(A + i);
			if ((*(A + i)) > 0) Num2++;
		}
		printf(" Ви задали масив з парною к-стю елементів.\n");
		printf(" Програма розрахує: \n\t - суму першої половини масиву з кількістю елементів - %d, яка рівна: %d", Half, Sum1);
		printf(" \n\t - кількість додатних елементів в цій частині рівна: %d", Num1); 
		printf(" \n\t - суму другої половини масиву з кількістю елементів - %d, яка рівна: %d", N*M-Half, Sum2);
		printf(" \n\t - кількість додатних елементів в цій частині рівна: %d", Num2);
	}
}